ElonYao/FOC_test/c2000.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/boards/LAUNCHXL_F280039C" --device "F28003x" --part "F28003x_100PZ" --package "100PZ" --context "system" --product "C2000WARE@5.04.00.00"
 * @v2CliArgs --device "TMS320F280039C" --package "100PZ" --board "/boards/LAUNCHXL_F280039C" --context "system" --product "C2000WARE@5.04.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const analog           = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1          = analog.addInstance();
const asysctl          = scripting.addModule("/driverlib/asysctl.js");
const can              = scripting.addModule("/driverlib/can.js", {}, false);
const can1             = can.addInstance();
const cmpss            = scripting.addModule("/driverlib/cmpss.js", {}, false);
const cmpss1           = cmpss.addInstance();
const cmpss2           = cmpss.addInstance();
const cmpss3           = cmpss.addInstance();
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const cputimer2        = cputimer.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const i2c              = scripting.addModule("/driverlib/i2c.js", {}, false);
const i2c1             = i2c.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const sci              = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1             = sci.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.socHighPriorityMode            = "ADC_PRI_ALL_HIPRI";
adc1.adcClockPrescaler              = "ADC_CLK_DIV_2_0";
adc1.soc1Channel                    = "ADC_CH_ADCIN11";
adc1.soc1SampleWindow               = 14;
adc1.soc1IndependentNameMode        = true;
adc1.soc1Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc1.interrupt1SOCSource            = "ADC_SOC_NUMBER3";
adc1.enableInterrupt1               = true;
adc1.ppb1SOCNumber                  = "ADC_SOC_NUMBER1";
adc1.$name                          = "Motor_IS_ADC";
adc1.enabledSOCs                    = ["ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc1.soc1Name                       = "Motor_IU_ADC";
adc1.soc2IndependentNameMode        = true;
adc1.soc2Name                       = "Motor_VU_ADC";
adc1.soc2Channel                    = "ADC_CH_ADCIN2";
adc1.soc2SampleWindow               = 20;
adc1.soc3IndependentNameMode        = true;
adc1.soc3Channel                    = "ADC_CH_ADCIN6";
adc1.soc3SampleWindow               = 20;
adc1.soc3Name                       = "Motor_Vdc_ADC";
adc1.soc3Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.registerInterrupts             = ["1"];
adc1.ppb2SOCNumber                  = "ADC_SOC_NUMBER2";
adc1.soc2Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.enabledPPBs                    = ["ADC_PPB_NUMBER1"];
adc1.enabledInts                    = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1ContinuousMode = true;

adc2.$name                   = "myADC0";
adc2.adcBase                 = "ADCB_BASE";
adc2.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc2.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc2.soc1IndependentNameMode = true;
adc2.soc1Name                = "Motor_IV_ADC";
adc2.soc1Channel             = "ADC_CH_ADCIN12";
adc2.soc1SampleWindow        = 14;
adc2.soc2IndependentNameMode = true;
adc2.soc2Name                = "Motor_VV_ADC";
adc2.soc2Channel             = "ADC_CH_ADCIN9";
adc2.soc2SampleWindow        = 20;
adc2.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.ppb1SOCNumber           = "ADC_SOC_NUMBER1";
adc2.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc2.ppb2SOCNumber           = "ADC_SOC_NUMBER2";
adc2.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.enabledPPBs             = ["ADC_PPB_NUMBER1"];
adc2.useInterrupts           = false;

adc3.$name                   = "myADC1";
adc3.adcBase                 = "ADCC_BASE";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc3.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc3.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc3.soc1IndependentNameMode = true;
adc3.soc1Name                = "Motor_IW_ADC";
adc3.soc1Channel             = "ADC_CH_ADCIN3";
adc3.soc1SampleWindow        = 14;
adc3.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc2IndependentNameMode = true;
adc3.soc2Name                = "Motor_VW_ADC";
adc3.soc2Channel             = "ADC_CH_ADCIN4";
adc3.soc2SampleWindow        = 20;
adc3.ppb1SOCNumber           = "ADC_SOC_NUMBER1";
adc3.ppb2SOCNumber           = "ADC_SOC_NUMBER2";
adc3.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.enabledPPBs             = ["ADC_PPB_NUMBER1"];
adc3.useInterrupts           = false;

can1.$name                 = "myCAN0";
can1.msgObjsUsed           = [1,2];
can1.enableInterrupt       = true;
can1.interruptLine         = ["CAN_GLOBAL_INT_CANINT0"];
can1.interruptFlags        = ["CAN_INT_ERROR","CAN_INT_IE0","CAN_INT_STATUS"];
can1.can.$assign           = "CANA";
can1.can.can_rxPin.$assign = "boosterpack1.19";
can1.can.can_txPin.$assign = "boosterpack2.48";
can1.msgObj1.$name         = "msgObj0";
can1.msgObj1.msgID         = 256;
can1.msgObj1.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj1.msgLen        = 8;
can1.msgObj2.$name         = "msgObj1";
can1.msgObj2.msgID         = 257;
can1.msgObj2.flags         = ["CAN_MSG_OBJ_RX_INT_ENABLE","CAN_MSG_OBJ_USE_ID_FILTER"];
can1.msgObj2.msgIDMask     = 1023;
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to SPIA BP on the LaunchPad F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", can1.can, "can_rxPin");

cmpss1.enableModule         = true;
cmpss1.highCTRIPOUT         = "CMPSS_TRIPOUT_FILTER";
cmpss1.highCTRIP            = "CMPSS_TRIP_FILTER";
cmpss1.$name                = "CMPSS_U";
cmpss1.lowCTRIPOUT          = "CMPSS_TRIPOUT_FILTER";
cmpss1.lowCTRIP             = "CMPSS_TRIP_FILTER";
cmpss1.lowCompInvert        = true;
cmpss1.thresholdHigh        = 30;
cmpss1.samplePrescaleHigh   = 32;
cmpss1.sampleWindowHigh     = 32;
cmpss1.initFilterHigh       = true;
cmpss1.samplePrescaleLow    = 32;
cmpss1.sampleWindowLow      = 32;
cmpss1.thresholdLow         = 30;
cmpss1.initFilterLow        = true;
cmpss1.hysteresisVal        = "2";
cmpss1.clearFilterLatchLow  = true;
cmpss1.clearFilterLatchHigh = true;
cmpss1.dacValHigh           = 3584;
cmpss1.dacValLow            = 512;
cmpss1.asysCMPHPMXSELValue  = "1";
cmpss1.asysCMPLPMXSELValue  = "1";

cmpss2.cmpssBase            = "CMPSS3_BASE";
cmpss2.$name                = "CMPSS_V";
cmpss2.asysCMPHPMXSELValue  = "1";
cmpss2.asysCMPLPMXSELValue  = "1";
cmpss2.enableModule         = true;
cmpss2.highCTRIPOUT         = "CMPSS_TRIPOUT_FILTER";
cmpss2.highCTRIP            = "CMPSS_TRIP_FILTER";
cmpss2.lowCompInvert        = true;
cmpss2.lowCTRIPOUT          = "CMPSS_TRIPOUT_FILTER";
cmpss2.lowCTRIP             = "CMPSS_TRIP_FILTER";
cmpss2.hysteresisVal        = "2";
cmpss2.initFilterHigh       = true;
cmpss2.clearFilterLatchHigh = true;
cmpss2.samplePrescaleHigh   = 32;
cmpss2.sampleWindowHigh     = 32;
cmpss2.thresholdHigh        = 30;
cmpss2.initFilterLow        = true;
cmpss2.clearFilterLatchLow  = true;
cmpss2.samplePrescaleLow    = 32;
cmpss2.sampleWindowLow      = 32;
cmpss2.thresholdLow         = 30;
cmpss2.dacValLow            = 512;
cmpss2.dacValHigh           = 3584;

cmpss3.cmpssBase            = "CMPSS4_BASE";
cmpss3.$name                = "CMPSS_W";
cmpss3.enableModule         = true;
cmpss3.hysteresisVal        = "2";
cmpss3.highCTRIPOUT         = "CMPSS_TRIPOUT_FILTER";
cmpss3.highCTRIP            = "CMPSS_TRIP_FILTER";
cmpss3.dacValHigh           = 3584;
cmpss3.initFilterHigh       = true;
cmpss3.clearFilterLatchHigh = true;
cmpss3.samplePrescaleHigh   = 32;
cmpss3.sampleWindowHigh     = 32;
cmpss3.thresholdHigh        = 30;
cmpss3.asysCMPHPMXSELValue  = "1";
cmpss3.lowCompInvert        = true;
cmpss3.lowCTRIPOUT          = "CMPSS_TRIPOUT_FILTER";
cmpss3.lowCTRIP             = "CMPSS_TRIP_FILTER";
cmpss3.dacValLow            = 512;
cmpss3.initFilterLow        = true;
cmpss3.samplePrescaleLow    = 32;
cmpss3.sampleWindowLow      = 32;
cmpss3.thresholdLow         = 30;
cmpss3.asysCMPLPMXSELValue  = "1";

