ElonYao/FOC_test/c2000.syscfg
i2c1.$name              = "AS5600";
i2c1.bitCount           = "I2C_BITCOUNT_8";
i2c1.useFifo            = false;
i2c1.emulationMode      = "I2C_EMULATION_FREE_RUN";
i2c1.$hardware          = system.deviceData.board.components.BP_SITE_1.subComponents.I2C;
i2c1.registerInterrupts = true;
i2c1.enabledInterrupts  = ["I2C_INT_REG_ACCESS_RDY","I2C_INT_STOP_CONDITION"];
i2c1.targetAddress      = 0x36;
i2c1.useInterrupts      = false;
i2c1.sdaQual.padConfig  = "STD";
i2c1.sclQual.padConfig  = "STD";

inputxbar_input1.$name         = "OT_inputX";
inputxbar_input1.inputxbarGpio = "GPIO33";
inputxbar_input1.inputxbarLock = true;

sci1.$name         = "PC_SCI";
sci1.$hardware     = system.deviceData.board.components.XDS_UART.subComponents.XDS_SCI_INST2;
sci1.useInterrupts = false;
sci1.rxQual.$name  = "myGPIOQUAL0";
sci1.txQual.$name  = "myGPIOQUAL1";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                  = "ANALOG";
analog1.analog["a11/b10/c0Pin"].$suggestSolution = "boosterpack1.27";
analog1.analog["a14/b14/c4Pin"].$suggestSolution = "boosterpack1.26";
analog1.analog["a2/b6/c9Pin"].$suggestSolution   = "boosterpack1.24";
analog1.analog["a3, c7/b9Pin"].$suggestSolution  = "boosterpack1.25";
analog1.analog.a6Pin.$suggestSolution            = "boosterpack1.23";
analog1.analog["c2/b12Pin"].$suggestSolution     = "boosterpack1.28";
analog1.analog["c3/a7Pin"].$suggestSolution      = "boosterpack1.29";
epwm1.epwm.$suggestSolution                      = "EPWM1";
epwm1.epwm.epwm_aPin.$suggestSolution            = "boosterpack1.40";
epwm1.epwm.epwm_bPin.$suggestSolution            = "boosterpack1.39";
epwm2.epwm.$suggestSolution                      = "EPWM2";
epwm2.epwm.epwm_aPin.$suggestSolution            = "boosterpack1.38";
epwm2.epwm.epwm_bPin.$suggestSolution            = "boosterpack1.37";
epwm3.epwm.$suggestSolution                      = "EPWM6";
epwm3.epwm.epwm_aPin.$suggestSolution            = "boosterpack1.36";
epwm3.epwm.epwm_bPin.$suggestSolution            = "boosterpack1.35";
i2c1.i2c.$suggestSolution                        = "I2CB";
i2c1.i2c.i2c_sdaPin.$suggestSolution             = "boosterpack1.10";
i2c1.i2c.i2c_sclPin.$suggestSolution             = "boosterpack1.9";
sci1.sci.$suggestSolution                        = "SCIB";
sci1.sci.sci_rxPin.$suggestSolution              = "boosterpack2.43";
sci1.sci.sci_txPin.$suggestSolution              = "boosterpack2.44";
